{"authorDailyContributionsMap":{"ShanylOng":[{"date":"2024-02-05","commitResults":[{"hash":"7cde104460f1490381b78a097d52622702ef6be8","isMergeCommit":false,"messageTitle":"Renamed, and added code for greet and exit.","messageBody":"","tags":["Level-0"],"fileTypesAndContributionMap":{"java":{"insertions":15,"deletions":0}}},{"hash":"e71150fa675025d83e8f13a3ebaec9eefa2096d1","isMergeCommit":false,"messageTitle":"Added the echo function, and indentations to the output. Minor changes to the wording of the greet and exit functions.","messageBody":"","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":22,"deletions":13}}},{"hash":"1e73e3c8d518470ac77b95e92f3553f970e38a93","isMergeCommit":false,"messageTitle":"Add listMode()","messageBody":"Added an ArrayList containing listItem objects, which contain a name and a status (true or false) to indicate whether they have been marked. I\u0027ve also checked the git commit messsage conventions and will be following those conventions henceforth.\n\nI\u0027ve made some minor changes to the output of the chatbot, such as some basic indentation changes in order to match the example provided. In addition, i\u0027ve also added comments to make my code more readable.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":67,"deletions":4}}},{"hash":"1409f90391c7a8b6f1a197a95e19e10aafd132d6","isMergeCommit":false,"messageTitle":"Add Mark-as-done functionality","messageBody":"Added the ability to mark and unmark tasks in the list of tasks, and changed names of the tasklist ArrayList and the Task class. Added text output thatprints before a list is printed, in order to replcate the functionality in the example provided. As I had formerly implemented a Task class already, adding the mark-unmark functionality was trivial.\n","tags":["Level-3"],"fileTypesAndContributionMap":{"java":{"insertions":44,"deletions":20}}}]},{"date":"2024-02-11","commitResults":[{"hash":"1269e15d590ca16611dcefdd4b8c8ad0a08f1938","isMergeCommit":false,"messageTitle":"Add ToDos, Deadlines, and Events","messageBody":"Added the ToDo, Deadline, and Event subclasses, which inherit from the Task type, which each subclass having some slightly different functionality from each other. Used Regular Expressions for pattern matching in order to make sure that the command line input is clean, and the relevant fields such as the different time fields and task names could be picked out easily. Renamed the file and the overarching class to Barry.java and Barry respectively. I shifted the locations of some of the variables from the subclasses to the Task superclass, in order to preserve some OOP principles. I added accessor methods for all the private variables. I created a detailsAsString abstract method in the Task class, which is overriden by the subclasses to provide slightly different functionality. I created a help method, which returns a list of all available commands, which also indicates the correct format in which to use the command. I also error-proofed all commands, and used Exceptions in order to handle OutOfBounds Exceptions, when invalid array indexes were provided. I also added some very minor changes to the way that the chatbot responds, in order to make it more human-like. These include changes to the text output of the Barry chatbot, as well as adding pluralities in the event of more than one task. I also performed checks to ensure that a task was not already marked or unmarked, informing a user if a task was already marked/unmarked, and suggesting to use the unmark/mark command instead. I added a line of text output to the task adding commands that indicate the number of tasks in the list. I also removed the unused echo method. Each task adding command checks the command to see whether its in the correct format first, using Regular Expressions. If an incorrect format is detected, the chatbot will correctly identify the attempted command, based off the first few characters of the command, and provide help to the user accordingly in the form of a text output, directing the user in the correct direction. Finally, in the event that the user enters a command that does not match any known command, the chatbot now tells the user that it does not recognise the command, and suggests accessing the help menu once again.\n","tags":["Level-4"],"fileTypesAndContributionMap":{"java":{"insertions":299,"deletions":121}}},{"hash":"810664b89ccf8bf7b21d3014c433d4c4f0dd7324","isMergeCommit":false,"messageTitle":"Add Automated Text UI Testing","messageBody":"Edited the batch file under the text-ui-test folder, in order to allow for automated testing functionality. Added a few simple commands, and limited it to 16 commands as the batch file maxed out testing 16 commands. Inserted the relevant expected response into the EXPECTED.TXT file.\n","tags":["A-TextUiTesting"],"fileTypesAndContributionMap":{"txt":{"insertions":16,"deletions":0},"bat":{"insertions":1,"deletions":1},"sh":{"insertions":0,"deletions":38}}},{"hash":"71e0e55889a8067d68e1d93c730c2443fc5c20ed","isMergeCommit":false,"messageTitle":"Add Error handling behaviour","messageBody":"Added error handling in the previous commits, and also added the personalised messages for incorrectly formatted commands. Also added special handling behaviour in the event of an invalid or unrecognised command.\n","tags":["Level-5"],"fileTypesAndContributionMap":{"java":{"insertions":1,"deletions":1}}},{"hash":"79d71f670289f30f08b6f3e2253ff948187dbb63","isMergeCommit":false,"messageTitle":"Add Delete functionality","messageBody":"Added delete command which allows users to delete tasks in their list by number. Added similar error-handling functionaliy to that for the unmark command. Also removed redundant methods, and changed access modifiers of certain methods in the Task class to be protected, reflecting their status as protected methods. Also customised the delete message that is printed upon removing a task from the list.\n","tags":["Level-6"],"fileTypesAndContributionMap":{"txt":{"insertions":2,"deletions":2},"java":{"insertions":35,"deletions":16}}},{"hash":"412aed18cd3ea762a999ced1bd3515a39a8df146","isMergeCommit":false,"messageTitle":"Enums not added","messageBody":"I chose not to add an enums as adding enums would not improve the current functionality, efficiency, or the readability of the current program, just like how I did not need to define my own exceptions in the previous level as my code was able to handle all errors possible in the current condition of the program. I edited my help command to reflect the new delete command, and also edited the EXPECTED.txt file to reflect the new correct implementation of the help function.\n","tags":["A-Enums"],"fileTypesAndContributionMap":{"java":{"insertions":4,"deletions":0}}}]}]},"authorFileTypeContributionMap":{"ShanylOng":{"java":322,"md":0,"fxml":0,"sh":0,"bat":1,"gradle":0,"txt":16}},"authorContributionVariance":{"ShanylOng":12536.41},"authorDisplayNameMap":{"ShanylOng":"CS2103T-T12-3 SHAN.. ONG"}}
